Autodesk.Revit.DB.Mechanical.SystemCalculationLevel
Since:
2012
Enumerated type listing flags that can toggle on or off certain calculations related to MEP systems.
Since:
2012

Autodesk.Revit.DB.Mechanical.SystemCalculationLevel.Performance
This mode is reserved for limiting the system propagation and other performance-boosting options.
Note that the system-related functionalities might be traded off for faster layout capability in large system when this mode is on.
Be careful that this mode is NOT included in the "All" mode.

Autodesk.Revit.DB.Mechanical.SystemCalculationLevel.Volume
This mode is obsoleted in Revit 2017.

Autodesk.Revit.DB.Mechanical.SystemCalculationLevel.Flow
System calculation is only for flow

Autodesk.Revit.DB.Mechanical.SystemCalculationLevel.None
System calculation is off

Autodesk.Revit.DB.Mechanical.SystemCalculationLevel.All
System calculation is on for everything (with every bit being 1)